Documents/Renault_ЗаменаБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_ЗаменаБСО</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Renault_СтатусыБСО</xr:Item>
				<xr:Item>InformationRegister.Renault_ЗаменыБСО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НовыйСК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйТип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСерия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйСК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйТип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйСерия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмЗамены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_АлгоритмыЗаменыБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйПолис</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_СтраховойПолис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйПолис</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_СтраховойПолис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтарогоБСО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СтатусыСтарыхБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_ЗаменыБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ЗаменыБСО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтарыйСК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтарыйТип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтарыйСерия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтарыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АлгоритмЗамены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_АлгоритмыЗаменыБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйПолис</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_СтраховойПолис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйПолис</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_СтраховойПолис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтарогоБСО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СтатусыСтарыхБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НовыйСК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НовыйТип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НовыйСерия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НовыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_СтатусыБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_СтатусыБСО</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СтатусыБСО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерБСО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_АлгоритмыЗаменыБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_АлгоритмыЗаменыБСО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВписаниеДоплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаКвитанции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Renault_СтатусыСтарыхБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_СтатусыСтарыхБСО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Чистый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Испорчен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданВОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыданВзамен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Renault_СтатусыБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_СтатусыБСО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятИзСК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданНаТочку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Испорчен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чистый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_ЗаменаБСО/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			Сообщить("Необходимо заполнить организацию!");
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтарыйСК) Тогда
			Сообщить("Необходимо заполнить СК старого БСО!");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтарыйТип) Тогда
			Сообщить("Необходимо заполнить тип старого БСО!");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтарыйНомер) Тогда
			Сообщить("Необходимо заполнить номер старого БСО!");
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НовыйСК) Тогда
			Сообщить("Необходимо заполнить СК нового БСО!");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НовыйТип) Тогда
			Сообщить("Необходимо заполнить тип нового БСО!");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НовыйНомер) Тогда
			Сообщить("Необходимо заполнить номер нового БСО!");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры   

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Renault_ЗаменыБСО
	Движения.Renault_ЗаменыБСО.Записывать = Истина;
	Движения.Renault_ЗаменыБСО.Очистить();
	Движение = Движения.Renault_ЗаменыБСО.Добавить();
	Движение.Организация = Организация;
	Движение.НовыйСК = НовыйСК;
	Движение.НовыйТип = НовыйТип;
	Движение.НовыйСерия = НовыйСерия;
	Движение.НовыйНомер = НовыйНомер;
	Движение.СтарыйСК = СтарыйСК;
	Движение.СтарыйТип = СтарыйТип;
	Движение.СтарыйСерия = СтарыйСерия;
	Движение.СтарыйНомер = СтарыйНомер;
	Движение.СуммаДоплаты = СуммаДоплаты;
	Движение.АлгоритмЗамены = АлгоритмЗамены;
	Движение.НовыйПолис = НовыйПолис;
	Движение.СтарыйПолис = СтарыйПолис;
	Движение.СтатусСтарогоБСО = СтатусСтарогоБСО;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	Движения.Renault_СтатусыБСО.Записывать = Истина;
	Движения.Renault_СтатусыБСО.Очистить();
	Если АлгоритмЗамены = Перечисления.Renault_АлгоритмыЗаменыБСО.ОшибкаОформления И СтатусСтарогоБСО = Перечисления.Renault_СтатусыСтарыхБСО.Испорчен Тогда
		Движение = Движения.Renault_СтатусыБСО.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СтраховаяКомпания = СтарыйСК;
		Движение.ТипБСО = СтарыйТип;
		Движение.СерияБСО = СтарыйСерия;
		Движение.НомерБСО = СтарыйНомер;
		Движение.Статус = Перечисления.Renault_СтатусыБСО.Испорчен;
	КонецЕсли;	
	
	Если АлгоритмЗамены = Перечисления.Renault_АлгоритмыЗаменыБСО.ЗаменаКвитанции Тогда
		
		Движение = Движения.Renault_СтатусыБСО.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СтраховаяКомпания = СтарыйСК;
		Движение.ТипБСО = СтарыйТип;
		Движение.СерияБСО = СтарыйСерия;
		Движение.НомерБСО = СтарыйНомер;
		Движение.Статус = Перечисления.Renault_СтатусыБСО.Испорчен;
		
		Движение = Движения.Renault_СтатусыБСО.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СтраховаяКомпания = НовыйСК;
		Движение.ТипБСО = НовыйТип;
		Движение.СерияБСО = НовыйСерия;
		Движение.НомерБСО = НовыйНомер;
		Движение.Статус = Перечисления.Renault_СтатусыБСО.Продан;
		
	КонецЕсли;	
	
	
КонецПроцедуры
